[NoCoverage] LogicalOperator
app.ts:6:14
 import cors from 'cors';
 import fs from 'fs'
 export const app: Application = express();
-const port = process.env.SERVER_PORT || 8080;
+const port = process.env.SERVER_PORT && 8080;
 app.use(cors());
 // default route

[NoCoverage] ConditionalExpression
app.ts:6:14
 import cors from 'cors';
 import fs from 'fs'
 export const app: Application = express();
-const port = process.env.SERVER_PORT || 8080;
+const port = false;
 app.use(cors());
 // default route

[NoCoverage] BlockStatement
app.ts:9:47
 const port = process.env.SERVER_PORT || 8080;
 app.use(cors());
 // default route
-app.get('/', (req: Request, res: Response) => {
-  console.log(req.method);
-  res.send('Hello world!');
-});
+app.get('/', (req: Request, res: Response) => {});
 
 app.get('/pictures', (req: Request, res: Response) => {

[NoCoverage] BlockStatement
app.ts:14:55
   res.send('Hello world!');
 });
 
-app.get('/pictures', (req: Request, res: Response) => {
-  console.log(req.method);
-  res.send('');
-})
+app.get('/pictures', (req: Request, res: Response) => {})
 
 app.get('/likes', (req: Request, res: Response) => {

[NoCoverage] BlockStatement
app.ts:19:52
   res.send('');
 })
 
-app.get('/likes', (req: Request, res: Response) => {
-  try {
-    const csvFile = fs.createReadStream(`${process.cwd()}/likes.csv`);
-    res
-      .status(200)
-      .setHeader("Content-Type", "text/csv")
-      .setHeader("Content-Disposition", `attachment; filename=likes.csv`)
-      .send(csvFile);
-  } catch (error) {
-    res.status(400).json({ error });
-  }
-});
+app.get('/likes', (req: Request, res: Response) => {});
 
 

[NoCoverage] BlockStatement
app.ts:20:7
 })
 
 app.get('/likes', (req: Request, res: Response) => {
-  try {
-    const csvFile = fs.createReadStream(`${process.cwd()}/likes.csv`);
-    res
-      .status(200)
-      .setHeader("Content-Type", "text/csv")
-      .setHeader("Content-Disposition", `attachment; filename=likes.csv`)
-      .send(csvFile);
-  } catch (error) {
+  try {} catch (error) {
     res.status(400).json({ error });
   }

[NoCoverage] StringLiteral
app.ts:24:34
     const csvFile = fs.createReadStream(`${process.cwd()}/likes.csv`);
     res
       .status(200)
-      .setHeader("Content-Type", "text/csv")
+      .setHeader("Content-Type", "")
       .setHeader("Content-Disposition", `attachment; filename=likes.csv`)
       .send(csvFile);

[NoCoverage] BlockStatement
app.ts:27:19
       .setHeader("Content-Type", "text/csv")
       .setHeader("Content-Disposition", `attachment; filename=likes.csv`)
       .send(csvFile);
-  } catch (error) {
-    res.status(400).json({ error });
-  }
+  } catch (error) {}
 });
 

[NoCoverage] BlockStatement
app.ts:34:24
 
 
 // start the express server
-app.listen(port, () => {
-  console.log(`server started at http://localhost:${port}`);
-});
+app.listen(port, () => {});
 
